{"intents": [
    {"tag": "introduce",
     "patterns": ["introduce your self", "please introduce us about your self", "", "Would you mind introducing yourself", "Welcome! - Please introduce yourself", "Tell me about yourself"],
     "responses": ["Well. Now I’m a fresher graduate. Now I spending time with problem-solving with python. And some works with some projects.", "Thank you sir. I passed my SSC and HSC in Pabna. That’s time was enjoyable for me. I love to play sports such as football, cricket. Also, I missing my university life. ", "I finished university a while ago. But at university, I have completed many projects. I did my final thesis on machine learning. So I want to take it for my carrier"],
     "context_set": ""
    },
    {"tag": "experiance",
     "patterns": ["How many experiences about AI?", "Are you experienced with our company?", "Your experiance?", "Please tell your working experiences", "your past work experience"],
     "responses": ["I did my final thesis on machine learning", "In AI I spend often one year learning better something. I worked on image classifications", "I can handle large datasets and able to visualize and also can able to predict values"],
     "context_set": ""
    },
    {"tag": "projects",
     "patterns": ["Please tell about your projects", "your completed projects", "Your university projects", "Describe An Important Project You Worked On", "effectively explain your projects"],
     "responses": ["Good- I already what is your namecompleted many projects with many languages. In final semester I works on machine learning projects", "In the final semester, I work on image classifications on machine learning projects. That’s are uploaded on git-hub with some other projects","My major projects working with python on machine learning. But I already have done some projects with other languages with different platforms. That’s are work full projects for me also"],
     "context_set": ""
    },
    {"tag": "name",
     "patterns": ["what is your name", "your name please", "whats your name?"],
     "responses": ["thank you. You can call me warid.", "I'm warid! sir", "ok- my name is warid"],
     "context_set": ""
    },
    {"tag": "job",
     "patterns": ["are you like this job or intern?", "Why do you want to do this job or intern?", "Why Are You Interested In This Job?"],
     "responses": ["I like this job or intern because your job laws are so good", "I have a lot to do with my job, so I am very interested in this job or intern"],
     "context_set": ""
    },
    {"tag": "salary",
     "patterns": ["Please mention your salary", "How much salary do you want to pay now?", "Your salary expectation"],
     "responses": ["I really want to learn work first so I have no interest in salary", "I'm not thinking about my salary", "as your wish about my salary"],
     "context_set": ""
    },
    {"tag": "start",
        "patterns": ["when you start with us?", "are you ready to start work?","when Can You Start"],
        "responses": ["thanks- i am ready to start any time", "grate- i can start any where any time", "when you needme sir to start"],
        "context_set": ""
       }
]
}